software-engineering-starter-web-04.html
---
layout: default
title: Software Engineering - Starter Web app 4
date: 2018-08-24
categories: software-engineering
---

<p>
In this episode, our hero (that's you!) will be learning a tool that is helpful
in virtually any kind of development you will wind up working in: Version
control. Version control is rarely taught in school. It can be somewhat a deep
topic, but we'll go over some basics of how you see it in the open source world,
which can carry over significantly to the commercial world.
</p>

<div id="outline-container-org07476c9" class="outline-2">
<h2 id="what's-version-control"><a id="org07476c9"></a><span class="section-number-2">1</span> what's version control?</h2>
<div class="outline-text-2" id="text-what's-version-control">
<p>
Version control is like the double-entry bookkeeping technique of saving all
of your hard work. If you recall on the last lesson, there was an off-the-cuff
statement about how your computer is just a fancy interface for working with
files. Version control typically excels at handling text files. This blog post
is a text file. HTML is text files. The original file that the blog post is
generated from is a text file. SVG images are also text files. There's also
non-text files. Generally we call these binary files, but really we could also
call them shit-files. That's a completely objective industry term and not me
showing any bias at all. Honest.
</p>

<p>
Double entry bookkeeping is something you might have had some exposure to in
grade school, where you have to write down every credit and debit that hits
your account, and there will be a corresponding debit or credit on some other
account. It's a ruthlessly simple model for handling money. We're going to use
a ruthlessly simple model for handling changes in text files. Version control
systems can handle binary files too, but things are more eww there, so we're
just going to skip over that for now.
</p>

<p>
Like the bookkeeping stuff, version control is expressed as just a series of
changes. Sure, you can write down what the final amount is somewhere in your
checking account, but the final amount is always some composition of all the
credits and debits since the dawn of time against your account. In the same
way any given text file can be seen as the composition of <b>changes</b> happening
over time to a text file.
</p>
</div>
</div>

<div id="outline-container-orgefa2c83" class="outline-2">
<h2 id="why"><a id="orgefa2c83"></a><span class="section-number-2">2</span> why?</h2>
<div class="outline-text-2" id="text-why">
<p>
There's a lot of benefits that fall out of version control, but perhaps a
primary driver for it is it allows us to capture a state in time that your
source code was in. As of version x in the software, some things might be
known such as features, bugs, and other behaviors. If we need to, we can go
back to that point. We can make fixes against software that we released a
while back.
</p>

<p>
Making fixes against older versions of the software can be helpful if we're
working on some shiny new feature, but we found out some critical bug in our
software that our uses are on right now. Caught with our proverbial software
pants down, we don't want to have to discard our current work nor do we want
to inflict some half-complete feature upon our users. Instead we can get in
our version-control-time-machine and assume a prior state of the code base,
make the fix, and roll it out. Once we're done we can switch back to working
on our shiny new feature.
</p>

<p>
At its most basic form, version control can serve as a super efficient text
backup system. It keeps a history of all of your changes made in little slices
at a time, and it stores these changes are just a series of changes (add this
line here, remove this other one, etc). Even if you aren't planning on doing
releases/rollbacks, or don't want to share code with others, you <span class="underline">need</span> to be
on version control. And believe me, if you want to find work out there, it
will be a boon in a job interview for your first position to be able to say
"yeah I use this". Otherwise they'll have to teach it to you, and while that's
all find and good, this is a fundamental skill we expect software engineers in
the industry to know.
</p>
</div>
</div>

<div id="outline-container-org12d4bad" class="outline-2">
<h2 id="git"><a id="org12d4bad"></a><span class="section-number-2">3</span> git</h2>
<div class="outline-text-2" id="text-git">
<p>
There are lots of version control systems out there, but <code>git</code> is kind of the
gold standard. Open source, free, and serverless, <code>git</code> can be very powerful
(thus very complicated) and an easy defacto standard for version control
software.
</p>

<p>
If you're on MacOS, you might have <code>git</code> installed already. That's okay but
let's make sure we're on the latest version with this:
</p>

<div class="org-src-container">
<pre class="src src-shell">$ brew install git
</pre>
</div>

<p>
While waiting for that to install, let's go over some <code>git</code> trivia. <code>git</code> was
a tool born of necessity as part of working on the Linux kernel. Torvalds
stated he named it "git" (roughly meaning idiot) because he needed to be
reminded that he was an idiot, or something. <code>git</code> transformed an insanely
vast open source project into something more manageable. <code>git</code> is
"distributed", meaning there's no central server that you <span class="underline">must</span> use. This
allows for arbitrary organization of your repository. Repository is the word
we give to a single code base, but repository doesn't imply code since it
works with just text. Sometimes we call a repository a "repo" for short.
</p>

<p>
This arbitrary organization allowed the Linux kernel to be divided up in a
more organic fashion. Linus Torvalds could assign a kind of trust to
"generals" in his open source army, who in turn could have lieutenants. This
means there's a kind of flow to the work being done. Lieutenants contribute to
various changes in the code base, which get reviewed, corrected, and vetted by
the generals. The generals then present the changes to Linus directly. This is
really helpful when you maintain a complex operating system kernel on largely
your spare time.
</p>
</div>
</div>

<div id="outline-container-org4454b49" class="outline-2">
<h2 id="creating-your-first-repo"><a id="org4454b49"></a><span class="section-number-2">4</span> creating your first repo</h2>
<div class="outline-text-2" id="text-creating-your-first-repo">
<p>
From working on our prior <code>cat-hatred</code> directory, we already have a code base
ready to become a repository.
</p>

<div class="org-src-container">
<pre class="src src-shell">$ cd ~/dev/cat-hatred
</pre>
</div>

<p>
From here, we can do our initialization command.
</p>

<div class="org-src-container">
<pre class="src src-shell">$ git init

Initialized empty Git repository<span style="color: #4f97d7; font-weight: bold;"> in</span> /Users/me/dev/cat-hatred/.git/
</pre>
</div>

<p>
That's it for making the repo! Kind of.
</p>
</div>
</div>

<div id="outline-container-org3e46e12" class="outline-2">
<h2 id="ignoring-files"><a id="org3e46e12"></a><span class="section-number-2">5</span> ignoring files</h2>
<div class="outline-text-2" id="text-ignoring-files">
<p>
We're not going to add everything to the repository.
</p>
</div>
