software-engineering-starter-web-04.org
** generated files
   :PROPERTIES:
   :CUSTOM_ID: ignoring-files--generated-files
   :END:

   Generally we want to not add generated files to our version control. This is
   because generated files can get large, unwieldy, and they are generally
   derived from some other authoritative file. This means pretty much anyone can
   regenerate those files at any time if we needed them. We want to discourage
   editing of generated files because when you run the generator again, and now
   you can see there's a change, who is correct in that change? It's hard to
   provide a concretely correct answer there, so best to opt out of that risk in
   the first place. If we need the generated files changed, we should assume the
   generator is always safe to run and that the source file that produces the
   generated file will somehow reflect the needed changes.

   Since we're in a Node project, the =node_modules= directory fits this bill
   perfectly of a series of generated files. The entire directory is managed by
   our package manager (for us, =yarn=). We want to ignore =node_modules=. =git=
   conventionally uses a =.gitignore= file to list file/directory names and
   patterns in order to ensure those files aren't "checked in". "Checking in" is
   something we do with our files. I don't recall if =git= specifically uses that
   terminology but I'm a little old and some the vocabulary from older systems
   will bleed over there. Rest assured there are people older than me in software
   engineering probably.

   We can create our =.gitignore= file and add =node_modules= to it in one
   stroke:

   #+begin_src shell
   $ echo "node_modules" > .gitignore
   #+end_src

** editor specific files
   :PROPERTIES:
   :CUSTOM_ID: ignoring-files--editor-specific-files
   :END:
   Depending on your editor choice, this may not be the complete story. Editors
   love to store their project+editor unique settings in a given repository. It
   would be easy to find out what those files are named and also add them to
   =.gitignore= but I urge you not to do that. There are a _lot_ of editors out
   there, and you don't want to inflict your holy editor upon others (just like
   you wouldn't want their garbage editors inflicted upon you). In this case
   "others" can also be your future self. For example, I'm going strong on Emacs
   right now, but I can quickly recall using seven other editors I've used
   before that, each with its own config files. It's your responsibility to
   avoid adding unnecessary clutter to the repository.

   With =git= you can add a global ignore file like so:

   #+begin_src shell
   $ git config --global core.excludesfile '~/.gitignore'
   #+end_src

   Find out what your editor's temporary and hidden files are and add them to
   this global git ignore file. If you change editors later, simply add to the
   file. You can even add ignore settings for your operating system as well
   (think =Thumbs.db= from Windows and =.DS_Store= on MacOS).

   While digging around for examples I found this excellent [[https://github.com/github/gitignore/tree/master/Global][gitignore repository]]
   where you can just lift settings for your editor and/or operating system. You
   can copy across multiple files, just separate them with lines. You can add
   comments starting with the =#= character to document sections if you like.

* adding your files
  :PROPERTIES:
  :CUSTOM_ID: adding-your-files
  :END:

  Make sure if you're jumping around that you've handled everything in the
  [[ignoring files]] section. Now we're going to add files to this repository.
  First, we can look to see what files are available with the =git status=
  command.

  #+begin_src shell
  $ git status

  On branch master

  No commits yet

  Untracked files:
    (use "git add <file>..." to include in what will be committed)

    accept-test.sh
    .gitignore
    package.json
    server.js
    yarn.lock

  nothing added to commit but untracked files present (use "git add" to track)

  #+end_src

  Your version may be more colorful than my post's, and that's okay. Generally
  untracked and modified files are displayed in red. Files that are "staged" for
  commit are shown in green. I realized red/green color blindness is very
  common, and I think these colors can be configured, but I haven't looked into
  that yet.

  To stage these files, we can use =git add <file1>, <file2>, ...=. You can also
  indicate a directory and it will get everything under that directory that
  isn't being ignored. Ignored files won't show up in the =git status= output
  _so long as they weren't committed earlier_.

  If your output differs than mine above then definitely ask about it, or
  retrace your steps. It can be a pain to take out files you didn't mean to add.
  You also lose badass points.

  Once you've made sure that's all correct, we'll add these files just one at a
  time to get used to the flow:

  #+begin_src shell
  $ git add accept-test.sh .gitignore package.json server.js yarn.lock
  #+end_src

  And now when you do =git status= again, you should see these are ready to
  commit:

  #+begin_src shell
  $ git status

  On branch master

  No commits yet

  Changes to be committed:
    (use "git rm --cached <file>..." to unstage)

    new file:   .gitignore
    new file:   accept-test.sh
    new file:   package.json
    new file:   server.js
    new file:   yarn.lock
  #+end_src

  All of the files will be green! And it describes that they are ready to be
  committed. Let's commit them!

* committing files
  :PROPERTIES:
  :CUSTOM_ID: committing-files
  :END:

  Regardless of where you stand with commitment, you must commit your files or
  this just isn't going to work between us. Generally when you issue a commit
  command, you are presented with your editor (whatever your system has listed
  for =EDITOR= in your shell's environment variables - frequently this is =nano=
  or =vim= but could be configured to be a number of things). This is so we can
  write a meaningful message for our commit. Instead of getting into those
  editors, we're going to use the =-m= flag to specify the commit message for
  today.

  #+begin_src shell
  $ git commit -m "initial commit"

    [master (root-commit) 8aed320] initial commit
    5 files changed, 380 insertions(+)
    create mode 100644 .gitignore
    create mode 100755 accept-test.sh
    create mode 100644 package.json
    create mode 100644 server.js
    create mode 100644 yarn.lock
  #+end_src

  The exact commit hash (=8aed320=) and insertions may differ for you and that's
  okay. Although the files listed should be the same. That's our first commit!

  In =git=, everything is represented as a series of commits along these things
  called branches or "refs". We'll get more into branching later.

