software-engineering-starter-web-04.html

<div id="outline-container-org3f53cff" class="outline-3">
<h3 id="ignoring-files--generated-files"><a id="org3f53cff"></a><span class="section-number-3">5.1</span> generated files</h3>
<div class="outline-text-3" id="text-ignoring-files--generated-files">
<p>
Generally we want to not add generated files to our version control. This is
because generated files can get large, unwieldy, and they are generally
derived from some other authoritative file. This means pretty much anyone can
regenerate those files at any time if we needed them. We want to discourage
editing of generated files because when you run the generator again, and now
you can see there's a change, who is correct in that change? It's hard to
provide a concretely correct answer there, so best to opt out of that risk in
the first place. If we need the generated files changed, we should assume the
generator is always safe to run and that the source file that produces the
generated file will somehow reflect the needed changes.
</p>

<p>
Since we're in a Node project, the <code>node_modules</code> directory fits this bill
perfectly of a series of generated files. The entire directory is managed by
our package manager (for us, <code>yarn</code>). We want to ignore <code>node_modules</code>. <code>git</code>
conventionally uses a <code>.gitignore</code> file to list file/directory names and
patterns in order to ensure those files aren't "checked in". "Checking in" is
something we do with our files. I don't recall if <code>git</code> specifically uses that
terminology but I'm a little old and some the vocabulary from older systems
will bleed over there. Rest assured there are people older than me in software
engineering probably.
</p>

<p>
We can create our <code>.gitignore</code> file and add <code>node_modules</code> to it in one
stroke:
</p>

<div class="org-src-container">
<pre class="src src-shell">$ echo <span style="color: #2d9574;">"node_modules"</span> &gt; .gitignore
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb80b24b" class="outline-3">
<h3 id="ignoring-files--editor-specific-files"><a id="orgb80b24b"></a><span class="section-number-3">5.2</span> editor specific files</h3>
<div class="outline-text-3" id="text-ignoring-files--editor-specific-files">
<p>
Depending on your editor choice, this may not be the complete story. Editors
love to store their project+editor unique settings in a given repository. It
would be easy to find out what those files are named and also add them to
<code>.gitignore</code> but I urge you not to do that. There are a <span class="underline">lot</span> of editors out
there, and you don't want to inflict your holy editor upon others (just like
you wouldn't want their garbage editors inflicted upon you). In this case
"others" can also be your future self. For example, I'm going strong on Emacs
right now, but I can quickly recall using seven other editors I've used
before that, each with its own config files. It's your responsibility to
avoid adding unnecessary clutter to the repository.
</p>

<p>
With <code>git</code> you can add a global ignore file like so:
</p>

<div class="org-src-container">
<pre class="src src-shell">$ git config --global core.excludesfile <span style="color: #2d9574;">'~/.gitignore'</span>
</pre>
</div>

<p>
Find out what your editor's temporary and hidden files are and add them to
this global git ignore file. If you change editors later, simply add to the
file. You can even add ignore settings for your operating system as well
(think <code>Thumbs.db</code> from Windows and <code>.DS_Store</code> on MacOS).
</p>

<p>
While digging around for examples I found this excellent <a href="https://github.com/github/gitignore/tree/master/Global">gitignore repository</a>
where you can just lift settings for your editor and/or operating system. You
can copy across multiple files, just separate them with lines. You can add
comments starting with the <code>#</code> character to document sections if you like.
</p>
</div>
</div>
</div>

<div id="outline-container-org90d92bd" class="outline-2">
<h2 id="adding-your-files"><a id="org90d92bd"></a><span class="section-number-2">6</span> adding your files</h2>
<div class="outline-text-2" id="text-adding-your-files">
<p>
Make sure if you're jumping around that you've handled everything in the
<a href="#ignoring-files">5</a> section. Now we're going to add files to this repository.
First, we can look to see what files are available with the <code>git status</code>
command.
</p>

<div class="org-src-container">
<pre class="src src-shell">$ git status

On branch master

No commits yet

Untracked files:
  <span style="color: #4f97d7;">(</span>use <span style="color: #2d9574;">"git add &lt;file&gt;..."</span> to include<span style="color: #4f97d7; font-weight: bold;"> in</span> what will be committed<span style="color: #4f97d7;">)</span>

  accept-test.sh
  .gitignore
  package.json
  server.js
  yarn.lock

nothing added to commit but untracked files present <span style="color: #4f97d7;">(</span>use <span style="color: #2d9574;">"git add"</span> to track<span style="color: #4f97d7;">)</span>

</pre>
</div>

<p>
Your version may be more colorful than my post's, and that's okay. Generally
untracked and modified files are displayed in red. Files that are "staged" for
commit are shown in green. I realized red/green color blindness is very
common, and I think these colors can be configured, but I haven't looked into
that yet.
</p>

<p>
To stage these files, we can use <code>git add &lt;file1&gt;, &lt;file2&gt;, ...</code>. You can also
indicate a directory and it will get everything under that directory that
isn't being ignored. Ignored files won't show up in the <code>git status</code> output
<span class="underline">so long as they weren't committed earlier</span>.
</p>

<p>
If your output differs than mine above then definitely ask about it, or
retrace your steps. It can be a pain to take out files you didn't mean to add.
You also lose badass points.
</p>

<p>
Once you've made sure that's all correct, we'll add these files just one at a
time to get used to the flow:
</p>

<div class="org-src-container">
<pre class="src src-shell">$ git add accept-test.sh .gitignore package.json server.js yarn.lock
</pre>
</div>

<p>
And now when you do <code>git status</code> again, you should see these are ready to
commit:
</p>

<div class="org-src-container">
<pre class="src src-shell">$ git status

On branch master

No commits yet

Changes to be committed:
  <span style="color: #4f97d7;">(</span>use <span style="color: #2d9574;">"git rm --cached &lt;file&gt;..."</span> to unstage<span style="color: #4f97d7;">)</span>

  new file:   .gitignore
  new file:   accept-test.sh
  new file:   package.json
  new file:   server.js
  new file:   yarn.lock
</pre>
</div>

<p>
All of the files will be green! And it describes that they are ready to be
committed. Let's commit them!
</p>
</div>
</div>

<div id="outline-container-org95aedd1" class="outline-2">
<h2 id="committing-files"><a id="org95aedd1"></a><span class="section-number-2">7</span> committing files</h2>
<div class="outline-text-2" id="text-committing-files">
<p>
Regardless of where you stand with commitment, you must commit your files or
this just isn't going to work between us. Generally when you issue a commit
command, you are presented with your editor (whatever your system has listed
for <code>EDITOR</code> in your shell's environment variables - frequently this is <code>nano</code>
or <code>vim</code> but could be configured to be a number of things). This is so we can
write a meaningful message for our commit. Instead of getting into those
editors, we're going to use the <code>-m</code> flag to specify the commit message for
today.
</p>

<div class="org-src-container">
<pre class="src src-shell">$ git commit -m <span style="color: #2d9574;">"initial commit"</span>

  <span style="color: #4f97d7;">[</span>master <span style="color: #bc6ec5;">(</span>root-commit<span style="color: #bc6ec5;">)</span> <span style="color: #a45bad;">8aed320</span><span style="color: #4f97d7;">]</span> initial commit
  <span style="color: #a45bad;">5</span> files changed, <span style="color: #a45bad;">380</span> insertions<span style="color: #4f97d7;">(</span>+<span style="color: #4f97d7;">)</span>
  create mode <span style="color: #a45bad;">100644</span> .gitignore
  create mode <span style="color: #a45bad;">100755</span> accept-test.sh
  create mode <span style="color: #a45bad;">100644</span> package.json
  create mode <span style="color: #a45bad;">100644</span> server.js
  create mode <span style="color: #a45bad;">100644</span> yarn.lock
</pre>
</div>

<p>
The exact commit hash (<code>8aed320</code>) and insertions may differ for you and that's
okay. Although the files listed should be the same. That's our first commit!
</p>

<p>
In <code>git</code>, everything is represented as a series of commits along these things
called branches or "refs". We'll get more into branching later.
</p>
</div>
</div>
