software-engineering-starter-web-04.org
* pushing files
  :PROPERTIES:
  :CUSTOM_ID: pushing-files
  :END:

  Right now, if your machine just caught fire and melted, you'd still lose your
  work forever and you'd probably be really sad because you lost all of this and
  those questionable pictures you weren't sure if you should put in a shared
  location for privacy reasons. All the work we've done thus far in =git= has
  been local. That means you could do this without any server connection. You
  can now bring your laptop out to the wilderness on that stupid camping trip
  and tell your hippie friends to piss off while you whip up a script that
  replaces their dog walking talents with a Roomba, and then commit that shit.
  I'm not bitter.

  We want to push your commit up to a server. There's a number of places we can
  put this, and they are free. Generally I use Github for my public stuff, and
  Bitbucket for my private stuff (both of which are free for their public and
  private use, respectively). There's also Gitlab, which you can self host and
  there's an online version, but I'm less familiar with its monetary aspects.

*** github
    :PROPERTIES:
    :CUSTOM_ID: pushing-files--github
    :END:

    Go to [[https://github.com][Github]] and setup an account there. Follow their instructions for
    setting up an SSH key. This will take some time and that's okay.

    Once it's done, you can create a new repository by going to their [[https://github.com/new][new
    repository page]]. Name the project "cat-hatred" (avoid spaces and caps!). You
    can leave the rest blank or default, and just click the create repository
    button. If you decided to go with something that's not Github, that's okay
    and the steps will likely be similar.

    Once you did that successfully, you'll be on a page that shows you what the
    repository git URL is. For me, it's
    =git@github.com:LoganBarnett/cat-hatred.git=. Yours will be similar but
    using your username instead of mine. Make sure you use yours and not mine!
    Okay?

    Okay.

    Copy that URL and go back to your terminal. You can add the repository to
    "origin", which is kind of a default "remote" (we'll dive into that more
    later).

    #+begin_src shell
    $ git remote add origin git@github.com:LoganBarnett/cat-hatred.git
    #+end_src

    That's what my command looks like - don't forget that yours should be using
    your username so it will be different than mine!

    Once that's done, we can do our first push with this command:

    #+begin_src shell
    $ git push

    Counting objects: 7, done.
    Delta compression using up to 4 threads.
    Compressing objects: 100% (6/6), done.
    Writing objects: 100% (7/7), 4.26 KiB | 2.13 MiB/s, done.
    Total 7 (delta 0), reused 0 (delta 0)
    To github.com:LoganBarnett/cat-hatred.git
    * [new branch]      master -> master
    #+end_src

    Assuming everything went without a hitch, you'll see some output like that.
    It will take a couple of seconds typically, as now you're reaching over a
    network. Congrats! You can even browse to your repo's page on Github and see
    the source code there. Mine is here:
    https://github.com/LoganBarnett/cat-hatred

* more, but...
  :PROPERTIES:
  :CUSTOM_ID: more-but...
  :END:

  There's a *lot* more to =git= than what I've shown you thus far, but now you
  can continue to do work, commit files that you change or add, and push them to
  your repository's online copy. In the future I will share code with you using
  =git=. For a solo endeavor, the skillset you have now will suffice. Now we can
  get back to making awesome software!
