software-engineering-starter-web-04.html

<div id="outline-container-org21245a3" class="outline-2">
<h2 id="pushing-files"><a id="org21245a3"></a><span class="section-number-2">8</span> pushing files</h2>
<div class="outline-text-2" id="text-pushing-files">
<p>
Right now, if your machine just caught fire and melted, you'd still lose your
work forever and you'd probably be really sad because you lost all of this and
those questionable pictures you weren't sure if you should put in a shared
location for privacy reasons. All the work we've done thus far in <code>git</code> has
been local. That means you could do this without any server connection. You
can now bring your laptop out to the wilderness on that stupid camping trip
and tell your hippie friends to piss off while you whip up a script that
replaces their dog walking talents with a Roomba, and then commit that shit.
I'm not bitter.
</p>

<p>
We want to push your commit up to a server. There's a number of places we can
put this, and they are free. Generally I use Github for my public stuff, and
Bitbucket for my private stuff (both of which are free for their public and
private use, respectively). There's also Gitlab, which you can self host and
there's an online version, but I'm less familiar with its monetary aspects.
</p>
</div>

<div id="outline-container-orgedb5e53" class="outline-4">
<h4 id="pushing-files--github"><a id="orgedb5e53"></a><span class="section-number-4">8.0.1</span> github</h4>
<div class="outline-text-4" id="text-pushing-files--github">
<p>
Go to <a href="https://github.com">Github</a> and setup an account there. Follow their instructions for
setting up an SSH key. This will take some time and that's okay.
</p>

<p>
Once it's done, you can create a new repository by going to their <a href="https://github.com/new">new
repository page</a>. Name the project "cat-hatred" (avoid spaces and caps!). You
can leave the rest blank or default, and just click the create repository
button. If you decided to go with something that's not Github, that's okay
and the steps will likely be similar.
</p>

<p>
Once you did that successfully, you'll be on a page that shows you what the
repository git URL is. For me, it's
<code>git@github.com:LoganBarnett/cat-hatred.git</code>. Yours will be similar but
using your username instead of mine. Make sure you use yours and not mine!
Okay?
</p>

<p>
Okay.
</p>

<p>
Copy that URL and go back to your terminal. You can add the repository to
"origin", which is kind of a default "remote" (we'll dive into that more
later).
</p>

<div class="org-src-container">
<pre class="src src-shell">$ git remote add origin git@github.com:LoganBarnett/cat-hatred.git
</pre>
</div>

<p>
That's what my command looks like - don't forget that yours should be using
your username so it will be different than mine!
</p>

<p>
Once that's done, we can do our first push with this command:
</p>

<div class="org-src-container">
<pre class="src src-shell">$ git push

Counting objects: <span style="color: #a45bad;">7,</span> done.
Delta compression using up to <span style="color: #a45bad;">4</span> threads.
Compressing objects: <span style="color: #a45bad;">100%</span> <span style="color: #4f97d7;">(</span><span style="color: #a45bad;">6/6</span><span style="color: #4f97d7;">)</span>, done.
Writing objects: <span style="color: #a45bad;">100%</span> <span style="color: #4f97d7;">(</span><span style="color: #a45bad;">7/7</span><span style="color: #4f97d7;">)</span>, <span style="color: #a45bad;">4.26</span> KiB | <span style="color: #a45bad;">2.13</span> MiB/s, done.
Total <span style="color: #a45bad;">7</span> <span style="color: #4f97d7;">(</span>delta <span style="color: #a45bad;">0</span><span style="color: #4f97d7;">)</span>, reused <span style="color: #a45bad;">0</span> <span style="color: #4f97d7;">(</span>delta <span style="color: #a45bad;">0</span><span style="color: #4f97d7;">)</span>
To github.com:LoganBarnett/cat-hatred.git
* <span style="color: #4f97d7;">[</span>new branch<span style="color: #4f97d7;">]</span>      master -&gt; master
</pre>
</div>

<p>
Assuming everything went without a hitch, you'll see some output like that.
It will take a couple of seconds typically, as now you're reaching over a
network. Congrats! You can even browse to your repo's page on Github and see
the source code there. Mine is here:
<a href="https://github.com/LoganBarnett/cat-hatred">https://github.com/LoganBarnett/cat-hatred</a>
</p>
</div>
</div>
</div>

<div id="outline-container-org913d5e2" class="outline-2">
<h2 id="more-but..."><a id="org913d5e2"></a><span class="section-number-2">9</span> more, but&#x2026;</h2>
<div class="outline-text-2" id="text-more-but...">
<p>
There's a <b>lot</b> more to <code>git</code> than what I've shown you thus far, but now you
can continue to do work, commit files that you change or add, and push them to
your repository's online copy. In the future I will share code with you using
<code>git</code>. For a solo endeavor, the skillset you have now will suffice. Now we can
get back to making awesome software!
</p>
</div>
</div>
